---
type: ValueParsingOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ValueParsingOptions

`Autodesk.Revit.DB.ValueParsingOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ValueParsingOptions | 2014 | `public ValueParsingOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFormatOptions | 2014 | `public FormatOptions GetFormatOptions ()` |
| Method | SetFormatOptions | 2014 | `public void SetFormatOptions ( FormatOptions formatOptions )` |
| Property | AllowedValues | 2014 | `public AllowedValues AllowedValues { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |